export default {
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~START MAIN INFO~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  phone:'+7 999 526 40 09',
  email:'safic1998@gmail.com',

  name:{
    ru:'Никита Cафронов',
    en:'Nikita Safronov',
  },

  language_skills:{
    ru:[
      ['Английский', 'B2'],
      ['Русский', 'Родной'],
      ['Японский', 'Базовый']
    ],
    en:[
      ['English', 'B2'],
      ['Russian', 'Native'],
      ['Japanese', 'Basic']
    ]
  },
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~END MAIN INFO~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~START IT SKILLS~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  it_skills:[
    [
      'Python',
      ['TensorFlow', 'OpenCV', 'aiohttp', 'SQLAlchemy']
    ],
    [
      'Web',
      ['JavaScript', 'HTML', 'CSS', 'Vue.js']
    ],
    [
      'C/C++',
      ['STM32',  'Raspberry PI', 'other MCUs', 'FreeRTOS']
    ],
    [
      'Android',
      ['Java']
    ],
  ],
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~END IT SKILLS~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~START TECH SKILLS~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  tech_skills:[
    [
      'CAD',
      ['NX Siemens', 'Creo Parametric', 'SolidWorks']
    ],
    [
      'OS',
      ['Ubuntu 16.04']
    ],
  ],
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~END TECH SKILLS~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~START ACHIEVEMENTS~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  achievements:[
    {
      ru:{
        events:[
          '-2 место в Хакатоне\n' +
          '«Цифровой прорыв» среди\n' +
          'региональных победителей.',

          '-1 место, в Хакатоне\n' +
          '«Цифровой прорыв»,\n' +
          'Сибирский IT-Hub'
        ],
      },
      en:{
        events:[]
      },
      invariant:{
        year:2020
      }
    },
    {
      ru:{
        events:[
          '- ТОП 10 среди 144 команд в\n' +
          'международном чемпионате\n' +
          'FIRST Tech Challenge в Сент-\n' +
          'Луисе, США'
        ],
      },
      en:{
        events:[]
      },
      invariant:{
        year:2016
      }
    },
    {
      ru:{
        events:[
          '- 2-е место, всемирные\n' +
          'соревнования World Robot\n' +
          'Olympiad (WRO) в Дохе,\n' +
          'Катар, 100+ участвующих\n' +
          'команд.',

          '- 1-е место, Russian Robotics\n' +
          'Olympiad (RRO), 200+\n' +
          'участников'
        ]
      },
      en:{
        events:[]
      },
      invariant:{
        year:2015
      }
    },
  ],
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~END ACHIEVEMENTS~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~START HOBBIES~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  hobbies:[
    {
      ru:{
        subject:'Научная фантастика',
        values:['чтение', 'написание']
      },
      en:{
        subject:'Sci-fi',
        values:['reading', 'writing']
      },
    },
    {
      ru:{
        subject:'Спорт',
        values:['плавание', 'бег']
      },
      en:{
        subject:'Sports',
        values:['swimming', 'running']
      },
    },
    {
      ru:{
        subject:'Игры',
        values:['Шахматы', 'Го', 'StarCraft II']
      },
      en:{
        subject:'Games',
        values:['Chess', 'Go', 'StarCraft II']
      },
    },
  ],
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~END HOBBIES~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~START EDUCATION~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  education:[
    {
      ru:{
        name:'Санкт-Петербургский Политехнический университет Петра Великого',
        period:'2016-2020',
        facts:[
          'Кафедра Мехатроники и Робототехники при ЦНИИ РТК',
          'Бакалавр в Мехатронике и Робототехнике (Средний балл 4.7/5.0)',
        ]
      },
      en:{
        name:'Peter the Great St. Petersburg Polytechnic University',
        period:'2016-2020',
        facts:[
          'Department of Mechatronics and Robotics at Russian State Scientific Center for Robotics and Technical Cybernetics',
          'B. Sc. in Mechatronics and Robotics (GPA 4.7/5.0)',
        ]
      }
    },
  ],
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~END EDUCATION~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~START EMPLOYMENT~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  employment:[
    {
      ru:{
        name:'Интернет-магазин орехов и сухофруктов Nut-Nut.ru (стартап)',
        position:'Сооснователь и Full-stack разработчик сайта магазина',
        period:'10.2020-наст. вр.',
        facts:[
          '......'
        ]
      },
      en:{
        name:'Интернет-магазин орехов и сухофруктов Nut-Nut.ru (стартап)',
        position:'Сооснователь и Full-stack разработчик сайта магазина',
        period:'10.2020-наст. вр.',
        facts:[
          '......'
        ]
      },
    },

    {
      ru:{
        name:'Air&Soil Technologies (стартап)',
        position:'Сооснователь и Технический директор по информационным технологиям',
        period:'2019-2020',
        facts:[
          'Разрабатывал современные системы машинного обучения для задач сельскохозяйственной индустрии',
          'Обработал датасеты из более 10к изображений для обучения нейронных сетей для системы компьютерного зрения',
          'Принимал участие в разработке 5 агро-робототехнических устройств (Прототип, Бета-версия)',
          'Разработал агро-робота для высокоточного опрыскивания растений (ИИ, Компьютерное зрение), который сократил расход химикатов в 2 раза',
          'Разработал эффективные и современные алгоритмы машинного обучения,которые увеличили точность опрыскивания на 25% и позволили уменьшить расход химикатов в 3 раза',
        ]
      },
      en:{
        name:'Air&Soil Technologies (стартап)',
        position:'Сооснователь и Технический директор по информационным технологиям',
        period:'2019-2020',
        facts:[
          'Разрабатывал современные системы машинного обучения для задач сельскохозяйственной индустрии',
          'Обработал датасеты из более 10к изображений для обучения нейронных сетей для системы компьютерного зрения',
          'Принимал участие в разработке 5 агро-робототехнических устройств (Прототип, Бета-версия)',
          'Разработал агро-робота для высокоточного опрыскивания растений (ИИ, Компьютерное зрение), который сократил расход химикатов в 2 раза',
          'Разработал эффективные и современные алгоритмы машинного обучения,которые увеличили точность опрыскивания на 25% и позволили уменьшить расход химикатов в 3 раза',
        ]
      },
    },

    {
      ru:{
        name:'Центральный научно-исследовательский институт Робототехники и Технической Кибернетики (ЦНИИ РТК)',
        position:'Производственная практика',
        period:'05-08.2019',
        facts:[
          'Разработал систему стерео-зрения для радиоуправляемого охранного робота, позволившую автоматизировать захват объекта и увеличить его скорость в 3 раза',
          'Создал промышленный дизайн (3D) в SolidWorks для 10+ различных робототехнических устройств',
          'Успешно разработал и реализовал более 6 программных алгоритмов для решения задач в области компьютерного зрения: распознавание сцены, классификация, распознавание активности',
          'Разработал, задокументировал, провел тестирование и отладку программного обеспечения для системы стерео-зрения',
        ]
      },
      en:{
        name:'Центральный научно-исследовательский институт Робототехники и Технической Кибернетики (ЦНИИ РТК)',
        position:'Производственная практика',
        period:'05-08.2019',
        facts:[
          'Разработал систему стерео-зрения для радиоуправляемого охранного робота, позволившую автоматизировать захват объекта и увеличить его скорость в 3 раза',
          'Создал промышленный дизайн (3D) в SolidWorks для 10+ различных робототехнических устройств',
          'Успешно разработал и реализовал более 6 программных алгоритмов для решения задач в области компьютерного зрения: распознавание сцены, классификация, распознавание активности',
          'Разработал, задокументировал, провел тестирование и отладку программного обеспечения для системы стерео-зрения',
        ]
      },
    },
    {
      ru:{
        name:'ФабЛаб университета ИТМО',
        position:'IT-специалист и заведующий лабораторией',
        period:'10.2017-01.2019',
        facts:[
          'Обучил 5 новых участников основам дата-сайенса и оказывал помощь в обучении сотрудников в работе с базами данных',
          'Разработал ПО на С/С++ для ~70 микроконтроллеров в более чем 40 различных робототехнических устройствах',
          'Консультировал и курировал 10+ инновационных технических проектов в лаборатории',
          'Выстраивал приоритеты проектов используя свою техническую экспертизу и разумно управлял временем в быстро меняющихся условиях',
        ]
      },
      en:{
        name:'ФабЛаб университета ИТМО',
        position:'IT-специалист и заведующий лабораторией',
        period:'10.2017-01.2019',
        facts:[
          'Обучил 5 новых участников основам дата-сайенса и оказывал помощь в обучении сотрудников в работе с базами данных',
          'Разработал ПО на С/С++ для ~70 микроконтроллеров в более чем 40 различных робототехнических устройствах',
          'Консультировал и курировал 10+ инновационных технических проектов в лаборатории',
          'Выстраивал приоритеты проектов используя свою техническую экспертизу и разумно управлял временем в быстро меняющихся условиях',
        ]
      },
    },
    {
      ru:{
        name:'Центр робототехники при Физико-Математическом Лицее №30',
        position:'Преподаватель и куратор',
        period:'09.2016-05.2017',
        facts:[
          'Обучил 30+ учеников старших классов программированию микроконтроллеров на C/C++ и основам схемотехники',
          'Помог организовать соревнования по робототехнике “Полигон ФМЛ 30”, в которых приняли участие 100+ команд',
        ]
      },
      en:{
        name:'Центр робототехники при Физико-Математическом Лицее №30',
        position:'Преподаватель и куратор',
        period:'09.2016-05.2017',
        facts:[
          'Обучил 30+ учеников старших классов программированию микроконтроллеров на C/C++ и основам схемотехники',
          'Помог организовать соревнования по робототехнике “Полигон ФМЛ 30”, в которых приняли участие 100+ команд',
        ]
      },
    },
  ],
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~END EMPLOYMENT~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~START PROJECTS~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  projects:[
    {
      ru:{
        name:'Сайт клуба ветеранов',
        status:'Некоммерческий университетский проект',
        period:'10.2018-06.2020',
        facts:[
          'Разработал дизайн и функционал сайта от проекта до финальной версии',
          'Постоянно администрировал и улучшал сайт в течение 2-х лет',
        ]
      },
      en:{
        name:'Сайт клуба ветеранов',
        status:'Некоммерческий университетский проект',
        period:'10.2018-06.2020',
        facts:[
          'Разработал дизайн и функционал сайта от проекта до финальной версии',
          'Постоянно администрировал и улучшал сайт в течение 2-х лет',
        ]
      },
    },
    {
      ru:{
        name:'Платный турникет в торговом центре в Вильнюсе, Литва',
        status:'Коммерческий проект',
        period:'06.2018–10.2018',
        facts:[
          'Разработал ПО для системы оплаты наличными и картой',
          'Собрал конструкцию системы оплаты и установил ее в торговом центре',
          'Прошел процедуру государственной сертификации устройства',
        ]
      },
      en:{
        name:'Платный турникет в торговом центре в Вильнюсе, Литва',
        status:'Коммерческий проект',
        period:'06.2018–10.2018',
        facts:[
          'Разработал ПО для системы оплаты наличными и картой',
          'Собрал конструкцию системы оплаты и установил ее в торговом центре',
          'Прошел процедуру государственной сертификации устройства',
        ]
      },
    },
    {
      ru:{
        name:'Звуковая скульптура «STELLA» с интерактивным управлением',
        status:'Коммерческий проект',
        period:'02.2018–08.2018',
        facts:[
          'Разработал программу для системы подсветки, которая визуализирует аудиопоток',
          'Создал панель управления для смены режимов работы',
        ]
      },
      en:{
        name:'Звуковая скульптура «STELLA» с интерактивным управлением',
        status:'Коммерческий проект',
        period:'02.2018–08.2018',
        facts:[
          'Разработал программу для системы подсветки, которая визуализирует аудиопоток',
          'Создал панель управления для смены режимов работы',
        ]
      },
    },
  ],
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~END PROJECTS~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~START SELF-EDUCATION~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  self_education:[
    {
      ru:{
        name:'Платформа открытого онлайн-образования Stepic',
        period:'2016-2018',
        facts:[
          'Изучил более 20 курсов, получил 6 сертификатов, из которых 3 с отличием (Python, Основы статистики, Введение в архитектуру ЭВМ)',
        ],
      },
      en:{
        name:'Платформа открытого онлайн-образования Stepic',
        period:'2016-2018',
        facts:[
          'Изучил более 20 курсов, получил 6 сертификатов, из которых 3 с отличием (Python, Основы статистики, Введение в архитектуру ЭВМ)',
        ],
      },
      invariant:{
        link:'https://stepik.org/users/28171578',
      }
    }
  ],
  //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~END SELF-EDUCATION~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

}
