export default {
  invariant:{
    phone:'+7 999 526 40 09',
    email:'safic1998@gmail.com',

    it_skills:[
      [
        'Python',
        ['TensorFlow', 'OpenCV', 'aiohttp', 'SQLAlchemy']
      ],
      [
        'Web',
        ['JavaScript', 'HTML', 'CSS']
      ],
      [
        'C/C++',
        ['STM32',  'Raspberry PI', 'other MCUs', 'FreeRTOS']
      ],
      [
        'Android',
        ['Java']
      ],
    ],
    tech_skills:[
      [
        'CAD',
        ['NX Siemens', 'Creo Parametric', 'SolidWorks']
      ],
      [
        'OS',
        ['Ubuntu 16.04']
      ],
    ]
  },

  ru:{
    name:'Никита Cафронов',
    language_skills:[
      ['Английский', 'B2'],
      ['Русский', 'Родной'],
      ['Японский', 'Базовый']
    ],

    achievements:[
      {
        year:2020,
        events:[
          '-2 место в Хакатоне\n' +
          '«Цифровой прорыв» среди\n' +
          'региональных победителей.',

          '-1 место, в Хакатоне\n' +
          '«Цифровой прорыв»,\n' +
          'Сибирский IT-Hub'
        ],
      },
      {
        year:2016,
        events:[
          '- ТОП 10 среди 144 команд в\n' +
          'международном чемпионате\n' +
          'FIRST Tech Challenge в Сент-\n' +
          'Луисе, США'
        ],
      },
      {
        year:2015,
        events:[
          '- 2-е место, всемирные\n' +
          'соревнования World Robot\n' +
          'Olympiad (WRO) в Дохе,\n' +
          'Катар, 100+ участвующих\n' +
          'команд.',

          '- 1-е место, Russian Robotics\n' +
          'Olympiad (RRO), 200+\n' +
          'участников'
        ]
      }
    ],

    hobbies:[
      {
        subject:'Научная фантастика',
        values:['чтение', 'написание']
      },
      {
        subject:'Спорт',
        values:['плавание', 'бег']
      },
      {
        subject:'Игры',
        values:['Шахматы', 'Го', 'StarCraft II']
      },
    ],

    education_exp:[
      {
        name:'Санкт-Петербургский Политехнический университет Петра Великого',
        period:'2016-2020',
        facts:[
          'Кафедра Мехатроники и Робототехники при ЦНИИ РТК',
          'Бакалавр в Мехатронике и Робототехнике (Средний балл 4.7/5.0)',
        ]
      }
    ],

    employment_exp:[
      {
        name:'Интернет-магазин орехов и сухофруктов Nut-Nut.ru (стартап)',
        position:'Сооснователь и Full-stack разработчик сайта магазина',
        period:'10.2020-сейчас',
        facts:[
          '......'
        ]
      },
      {
        name:'Air&Soil Technologies (стартап)',
        position:'Сооснователь и Технический директор по информационным технологиям',
        period:'2019-2020',
        facts:[
          'Разрабатывал современные системы машинного обучения для задач сельскохозяйственной индустрии',
          'Обработал датасеты из более 10к изображений для обучения нейронных сетей для системы компьютерного зрения',
          'Принимал участие в разработке 5 агро-робототехнических устройств (Прототип, Бета-версия)',
          'Разработал агро-робота для высокоточного опрыскивания растений (ИИ, Компьютерное зрение), который сократил расход химикатов в 2 раза',
          'Разработал эффективные и современные алгоритмы машинного обучения,которые увеличили точность опрыскивания на 25% и позволили уменьшить расход химикатов в 3 раза',
        ]
      },
      {
        name:'Центральный научно-исследовательский институт Робототехники и Технической Кибернетики (ЦНИИ РТК)',
        position:'Производственная практика',
        period:'05-08.2019',
        facts:[
          'Разработал систему стерео-зрения для радиоуправляемого охранного робота, позволившую автоматизировать захват объекта и увеличить его скорость в 3 раза',
          'Создал промышленных дизайн (3D) в SolidWorks для 10+ различных робототехнических устройств',
          'Успешно разработал и реализовал более 6 программных алгоритмов для решения задач в области компьютерного зрения: распознавание сцены, классификация, распознавание активности',
          'Разработал, задокументировал, провел тестирование и отладку программного обеспечения для системы стерео-зрения',
        ]
      },
      {
        name:'ФабЛаб университета ИТМО',
        position:'IT-специалист и заведующий лабораторией',
        period:'10.2017-01.2019',
        facts:[
          'Обучил 5 новых участников основам дата-сайенса и оказывал помощь в обучении сотрудников в работе с базами данных',
          'Разработал ПО на С/С++ для ~70 микроконтроллеров в более чем 40 различных робототехнических устройствах',
          'Консультировал и курировал 10+ инновационных технических проектов в лаборатории',
          'Выстраивал приоритеты проектов используя свою техническую экспертизу и разумно управлял временем в быстро меняющихся условиях',
        ]
      },
      {
        name:'Центр робототехники при Физико-Математическом Лицее №30',
        position:'Преподаватель и куратор',
        period:'09.2016-05.2017',
        facts:[
          'Обучил 30+ учеников старших классов программированию микроконтроллеров на C/C++ и основам схемотехники',
          'Помог организовать соревнования по робототехнике “Полигон ФМЛ 30”, в которых приняли участие 100+ команд',
        ]
      },
    ],

    projects_exp:[
      {
        name:'Сайт клуба ветеранов',
        status:'Некоммерческий университетский проект',
        period:'10.2018-06.2020',
        facts:[
          'Разработал дизайн и функционал сайта от проекта до финальной версии',
          'Постоянно администрировал и улучшал сайт в течение 2-х лет',
        ]
      },
      {
        name:'Платный турникет в торговом центре в Вильнюсе, Литва',
        status:'Коммерческий проект',
        period:'06.2018–10.2018',
        facts:[
          'Разработал ПО для системы оплаты наличными и картой',
          'Собрал конструкцию системы оплаты и установил ее в торговом центре',
          'Прошел процедуру государственной сертификации устройства',
        ]
      },
      {
        name:'Звуковая скульптура «Стела» с интерактивным управлением',
        status:'Коммерческий проект',
        period:'02.2018–08.2018',
        facts:[
          'Разработал программу для системы подсветки, которая визуализирует аудиопоток',
          'Создал панель управления для смены режимов работы',
        ]
      },
    ],

    self_education_exp:[
      {
        name:'Платформа открытого онлайн-образования Stepic',
        period:'2016-2018',
        facts:[
          'Изучил более 20 курсов, получил 6 сертификатов, из которых 3 с отличием (Python, Основы статистики, Введение в архитектуру ЭВМ)',
        ],
        link:'https://stepik.org/users/28171578',
      }
    ]

  },


}
